C2CRIBuildDir/projects/C2C-RI/src/RIGUI/CustomTestSuites/TMDDV301ExtensionToBlankTestSuite/InfoLayer/Data/TCS-71-dlLCSInventoryUpdate-EC-InValid-4.data

 
#<!--   
#       Title:  TCS-71-dlLCSInventoryUpdate-EC-InValid-4
#       Description:  This test case is used to verify the SUTs support of the dlLCSInventoryUpdate dialog as an EC using the variable values specified by the Test Plan.   This test case supports verification of requirements related to user need 2.3.6.8.2 [Need to Share Updated Controllable Lanes Inventory]. This Test Case tests for a InValid (4) response result.
#       Related Procedure:  TPS-71-dlLCSInventoryUpdate-EC
#       Version/Date: 2012/02/14 23:10:59
#-->

#ITERATION NAME = One
#GROUP NAME = General
#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = This variable represents whether the Test Case is expected to pass.
CheckOutcomePassed = true

#PARAMETER TYPE = String
#EDITABLE = false
#DOCUMENTATION = This variable represents whether the Test Case is expected to pass.
VerificationSpec = #VALUESPEC#Values#VALUESPEC#

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable identifies the Application Layer Standard that will be used for this test.
ApplicationLayerStandard = NTCIP2306v01

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Publication Message to be sent to the SUT.
PublicationMessage = <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://www.tmdd.org/302/messages"><soapenv:Header/><soapenv:Body><c2c:c2cMessagePublication xmlns:c2c="http://www.ntcip.org/c2c-message-administration"><informationalText>string</informationalText><subscriptionID>string</subscriptionID><subscriptionName>string</subscriptionName><subscriptionFrequency>7</subscriptionFrequency><subscriptionCount>7</subscriptionCount></c2c:c2cMessagePublication><mes:lCSInventoryMsg><lcs-inventory-item><device-inventory-header><restrictions><organization-information-forwarding-restrictions>4</organization-information-forwarding-restrictions></restrictions><organization-information><organization-id>string</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>string</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>3</horizontalDatum><height><altitude><kmDec>1000.00</kmDec></altitude><verticalDatum>1</verticalDatum></height></center-location><center-description>string</center-description><center-type>fixed</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></organization-information><device-id>string</device-id><device-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>nad27</horizontalDatum><height><verticalLevel>2</verticalLevel></height></device-location><device-name>string</device-name><device-description>string</device-description><device-control-type>status only</device-control-type><controller-description>string</controller-description><network-id>string</network-id><node-id>string</node-id><node-name>string</node-name><link-id>string</link-id><link-name>string</link-name><link-direction>s</link-direction><linear-reference>string</linear-reference><linear-reference-version>6</linear-reference-version><route-designator>string</route-designator><device-url>string</device-url><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></device-inventory-header><controlled-lane-number>6</controlled-lane-number><link-lane-count>6</link-lane-count></lcs-inventory-item></mes:lCSInventoryMsg></soapenv:Body></soapenv:Envelope>

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates number of publication message transmissions expected as part of this test.
PublicationCount = 0

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates whether a Publication  error response is expected from the SUT.
PublicationErrorResponseExpected = True

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates the type of Publication response error that is expected from the SUT.
PublicationErrorTypeExpected = 4

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This flag defines whether the Test Application will test for Authentication
AuthenticationCheck = False

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the expected user name.
Username = defaultUser

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the expected password.
Password = defaultPassword

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Organization Identifier.
OrganizationID = defaultOrgID

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates whether the SUT has the priviledge to access the information requested.
AllowAccess = True

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates whether a subscription request error is expected from the SUT.
SubscriptionErrorResponseExpected = True

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates the type of subscription request error that is expected from the SUT.
SubscriptionErrorTypeExpected = 4

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Subscription Response Message to be sent to the SUT.
SubscriptionResponseMessage = #MESSAGESPEC#SubResponseMessage#MESSAGESPEC#


#GROUP NAME = Values

